# DelVectorFill

## Description
Procedure DelVectorFill deletes the specified vector fill definition.

```pascal
PROCEDURE DelVectorFill(vectorFillName : STRING);
```

```python
def vs.DelVectorFill(vectorFillName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|vectorFillName|STRING|Name of vector fill.|

## Remarks
Deletes the hatch definition that has the name 'vectorFillName'

## Version
Availability: from MiniCAD7.0.1

## Category
* Hatches @ Vector Fills